cask_args appdir: '/Applications'

tap "homebrew/bundle"
tap "homebrew/core"
tap "caskroom/cask"
tap "caskroom/fonts"

## UNIX/CLI Utilities
brew "ack"													# better grep utility
brew "autoconf"												# Automatic configure script builder
brew "automake"												# Tool for generating GNU Standards-compliant Makefiles
brew "axel"													# Light UNIX download accelerator
brew "binutils"												# FSF/GNU ld, ar, readelf, etc. for native development
brew "binwalk"												# Searches a binary image for embedded files and executable code
brew "coreutils"											# GNU File, Shell, and Text utilities
brew "curl"													# Get a file from an HTTP, HTTPS or FTP server
brew "findutils"											# Collection of GNU find, xargs and locate
brew "foremost"												# Console program to recover files based on their headers and footers
brew "gnu-sed", args: ["with-default-names"]				# GNU implementation of the famous stream editor
brew "gnupg"												# GNU Pretty Good Privacy (PGP) package
brew "go"													# Open source programming language to build simple/reliable/efficient software
brew "grc"													# Colorize logfiles and command output
brew "grep"													# GNU grep, egrep and fgrep
brew "imagemagick", args: ["with-webp"]						# Tools and libraries to manipulate images in many formats
brew "libtool"												# Generic library support script
brew "lynx"													# Tezt-based web browser
brew "mas"													# Mac App Store command-line interface
brew "moreutils"											# Collection of tools that nobody wrote when UNIX was young
brew "netpbm"												# Image manipulation
brew "nmap"													# Port scanning utility for large networks
brew "openssh"												# OpenBSD freely-licensed SSH connectivity tools
brew "pngcheck"												# Print info and check PNG, JNG, and MNG files
brew "psgrep"												# Shortcut for the 'ps aux | grep' idiom
brew "pv"													# Monitor data's progress through a pipe
brew "p7zip"												# 7-Zip (high compression file archiver) implementation
brew "rename"												# Perl-powered file rename script with many helpful built-ins
brew "rlwrap"												# Readline wrapper: adds readline support to tools that lack it
brew "screen"												# Terminal multiplexer with VT100/ANSI terminal emulation
brew "ssh-copy-id"											# Add a public key to a remote machine's authorized_keys file
brew "tmux"													# Terminal multiplexer
brew "tree"													# Display directories as trees (with optional color/HTML output)
brew "vim", args: ["with-override-system-vi"]				# Vi 'workalike' with many additional features
brew "wget", args: ["with-iri"]								# Internet file retriever
brew "xz"													# General-purpose data compression with high compression ratio
brew "zopfli"												# New zlib (gzip, deflate) compatible compressor


## Improved shells
brew "bash"													# Upgrade bash to v4 instead of 3.2 (default with Mac)
brew "bash-completion2"										# Enables autocompleition for bash
brew "zsh"													# UNIX shell (command interpreter)
brew "zsh-completions"										# Additional completion definitions for zsh
brew "zsh-syntax-highlighting"								# Fish shell like syntax highlighting for zsh

## Mac utlities
brew "dockutil"												# Tool for managing dock items
brew "duti"													# Select default apps for documents and URL schemes on macOS

# GIT
brew "git"													# Distributed revision control system
brew "git-extras"											# Small git utilities
brew "git-lfs"												# Git extension for versioning large files
brew "git-flow"												# Extensions to follow Vincent Driessen's branching model		

## Font and Web Font Utilities
tap "bramstein/webfonttools"								# useful for creating web fonts
brew "bramstein/webfonttools/sfnt2woff"
brew "bramstein/webfonttools/sfnt2woff-zopfli"
brew "bramstein/webfonttools/woff2"
brew "freetype"												# Software library to render fonts

cask "font-anonymous-pro"
cask "font-dejavu-sans"
cask "font-comic-neue"
cask "font-computer-modern"
cask "font-ibm-plex"
cask "font-fira-code"
cask "font-fira-mono"
cask "font-hack"
cask "font-hack-nerd-font"
cask "font-hasklig"
cask "font-inconsolata"
cask "font-iosevka"
cask "font-menlo-for-powerline"
cask "font-monoid"
cask "font-montserrat"
cask "font-open-sans"
cask "font-open-sans-condensed"
cask "font-raleway"
cask "font-source-code-pro"
cask "font-source-sans-pro"
cask "font-terminus"
cask "font-times-new-roman"

## Casks
cask "1password"
cask "adobe-creative-cloud"
cask "adobe-acrobat-reader"
# cask "amazon-music"
cask "appcleaner"
cask "atom"
cask "authy"
cask "backblaze"
cask "cakebrew"
cask "discord"
# cask "docker"
cask "dropbox"
cask "easyfind"
cask "filebot"
cask "google-backup-and-sync"
cask "google-chrome"
cask "handbrake"
cask "iterm2"
cask "ivpn"
cask "java"
# cask "little-snitch"
cask "logos"
# ask "minecraft"
cask "mono-mdk"
cask "onedrive"
cask "omnidisksweeper"
cask "origin"
cask "plex-media-player"
cask "slack"
cask "spectacle"
cask "steam"
cask "spotify"
cask "sublime-text"
cask "the-unarchiver"
cask "transmission"
cask "twitch"
cask "vlc"
cask "ynab"

## Quick Look plugins
cask "qlcolorcode"
cask "qlstephen"
cask "qlmarkdown"
cask "quicklook-json"
cask "qlprettypatch"
cask "quicklook-csv"
cask "hetimazipql"
cask "qlimagesize"
cask "webpquicklook"
cask "suspicious-package"
cask "qlvideo"
cask "jupyter-notebook-ql"
cask "quicknfo"
cask "qlmobi"
cask "qladdict"

# MAS requires manual log in to work correctly but will install these applications
# MAS fails with Mojave
# mas "Day One", id:1055511498
# mas "Keynote", id:409183694
# mas "Numbers", id:409203825
# mas "Pages", id:409201541
# mas "Parcel", id:639968404
# mas "RollerCoaster Tycoon 3 Platinum", id:549294099
# mas "Slack", id:803453959
# mas "The Jackbox Party Pack 2", id:1034034328
# mas "Twitter", id:409789998
# mas "Xcode", id: 497799835
